# Introduction

## Introduction to pandas dataframe

In [1]:

# Importing Pandas to create DataFrame
import pandas as pd
 
# Creating Empty DataFrame and Storing it in variable df
df = pd.DataFrame()
 
# Printing Empty DataFrame
print(df)

Empty DataFrame
Columns: []
Index: []

In [2]:

# Import pandas library
import pandas as pd
 
# initialize list elements
data = [10,20,30,40,50,60]
 
# Create the pandas DataFrame with column name is provided explicitly
df = pd.DataFrame(data, columns=['Numbers'])
 
# print dataframe.
df

   Numbers
0       10
1       20
2       30
3       40
4       50
5       60

In [3]:

# Import pandas library
import pandas as pd
 
# initialize list of lists
data = [['tom', 10], ['nick', 15], ['juli', 14]]
 
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age'])
 
# print dataframe.
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [4]:

# Python code demonstrate creating
# DataFrame from dict narray / lists
# By default addresses.
 
import pandas as pd
 
# initialize data of lists.
data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [5]:

# Python code demonstrate creating
# pandas DataFrame with indexed by
 
# DataFrame using arrays.
import pandas as pd
 
# initialize data of lists.
data = {'Name': ['Tom', 'Jack', 'nick', 'juli'],
        'marks': [99, 98, 95, 90]}
 
# Creates pandas DataFrame.
df = pd.DataFrame(data, index=['rank1',
                               'rank2',
                               'rank3',
                               'rank4'])
 
# print the data
df

       Name  marks
rank1   Tom     99
rank2  Jack     98
rank3  nick     95
rank4  juli     90

In [6]:

# Python code demonstrate how to create
# Pandas DataFrame by lists of dicts.
import pandas as pd
 
# Initialize data to lists.
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]
 
# Creates DataFrame.
df = pd.DataFrame(data)
 
# Print the data
df

    a   b   c
0   1   2   3
1  10  20  30

In [7]:

# Python code demonstrate to create
# Pandas DataFrame by passing lists of
# Dictionaries and row indices.
import pandas as pd
 
# Initialize data of lists
data = [{'b': 2, 'c': 3}, {'a': 10, 'b': 20, 'c': 30}]
 
# Creates pandas DataFrame by passing
# Lists of dictionaries and row index.
df = pd.DataFrame(data, index=['first', 'second'])
 
# Print the data
df

         b   c     a
first    2   3   NaN
second  20  30  10.0

In [8]:

# Python code demonstrate to create a
# Pandas DataFrame with lists of
# dictionaries as well as
# row and column indexes.
 
import pandas as pd
 
# Initialize lists data.
data = [{'a': 1, 'b': 2},
        {'a': 5, 'b': 10, 'c': 20}]
 
# With two column indices, values same
# as dictionary keys
df1 = pd.DataFrame(data, index=['first',
                                'second'],
                   columns=['a', 'b'])
 
# With two column indices with
# one index with other name
df2 = pd.DataFrame(data, index=['first',
                                'second'],
                   columns=['a', 'b1'])
 
# print for first data frame
print(df1, "\n")
 
# Print for second DataFrame.
print(df2)

        a   b
first   1   2
second  5  10

        a  b1
first   1 NaN
second  5 NaN

In [9]:

# Python program to demonstrate creating
# pandas Dataframe from lists using zip.
 
import pandas as pd
 
# List1
Name = ['tom', 'krish', 'nick', 'juli']
 
# List2
Age = [25, 30, 26, 22]
 
# get the list of tuples from two lists.
# and merge them by using zip().
list_of_tuples = list(zip(Name, Age))
 
# Assign data to tuples.
list_of_tuples
 
 
# Converting lists of tuples into
# pandas Dataframe.
df = pd.DataFrame(list_of_tuples,
                  columns=['Name', 'Age'])
 
# Print data.
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

In [10]:

# Python code demonstrate creating
# Pandas Dataframe from series.
 
import pandas as pd
 
# Initialize data to series.
d =  pd.Series([10, 20, 30, 40])
# creates Dataframe.
df = pd.DataFrame(d)
 
# print the data.
df

    0
0  10
1  20
2  30
3  40

In [11]:

# Python code demonstrate creating
# Pandas Dataframe from Dicts of series.
 
import pandas as pd
 
# Initialize data to Dicts of series.
d = {'one': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd'])}
 
# creates Dataframe.
df = pd.DataFrame(d)
 
# print the data.
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

# Asad's Documentation

## How to create dataFrame

In [12]:
# initital column and index

index=[1911022,1911023,1911024]
columns=['class_1','class_2','class_3','class_4']

# initialize data

# it insert data row wise , we need this
data = [                
        {'class_1': 'P','class_2': 'P','class_3': 'P','class_4': 'P'}, 
        {'class_1': 'A','class_2': 'P','class_3': 'A','class_4': 'P'}, 
        {'class_1': 'P','class_2': 'P','class_3': 'A','class_4': 'P'}, 
       ]   

# Creates pandas DataFrame.
df = pd.DataFrame(data,index,columns)
 
# print the data
df

        class_1 class_2 class_3 class_4
1911022       P       P       P       P
1911023       A       P       A       P
1911024       P       P       A       P

## How to save dataframe

In [13]:
df.to_csv('name.csv')  # index=None    for ignore index

In [14]:
df.to_csv('encoded.csv', encoding='utf-8', index=False)

In [15]:
#try in local
#df.to_excel('xcel.xlsx', encoding='utf-8', index=False)

## How to read excel files

In [16]:
'''
Two Types excel file
1. .xlsx file: Excel files which are created using excel software, these are .xlsx files.
2. .csv file: In the above, which you exported, these are csv file

If you want to read these you need below code
'''

'\nTwo Types excel file\n1. .xlsx file: Excel files which are created using excel software, these are .xlsx files.\n2. .csv file: In the above, which you exported, these are csv file\n\nIf you want to read these you need below code\n'

In [17]:
#try in local
# For xlsx file, you need to install this by command promt 
# pip install openpyxl

In [18]:
# read xlsx file
#xlsx_file=pd.read_excel("theorical.xlsx",nrows=3)

In [59]:
#csv file

df=pd.read_csv('name.csv',index_col=0)  #index_col=0 to avoid index # encoding='ISO-8859-1'  to encoding

In [61]:
df

        class_1 class_2 class_3 class_4
1911022       P       P       P       P
1911023       A       P       A       P
1911024       P       P       A       P

## How to skip rows during reading

In [66]:
# How to skip rows
df2 = pd.read_csv('name.csv', index_col=0, skiprows=1)   # skip first 1 rows
df2

         P P.1 P.2 P.3
1911022
1911023  A   P   A   P
1911024  P   P   A   P

First was column, thats why column eliminated

In [70]:
#import DataFrame and skip 2nd and 3rd row
df2 = pd.read_csv('name.csv', index_col=0, skiprows=[2, 3])
df2

        class_1 class_2 class_3 class_4
1911022       P       P       P       P

## How to see index

In [21]:
df.index

Int64Index([1911022, 1911023, 1911024], dtype='int64')

In [22]:
# as a list
list(df.index)

[1911022, 1911023, 1911024]

In [23]:
#index quantity
len(df.index)

3

## how to see columns

In [24]:
df.columns

Index(['class_1', 'class_2', 'class_3', 'class_4'], dtype='object')

In [25]:
# as a list
list(df.columns)

['class_1', 'class_2', 'class_3', 'class_4']

In [26]:
# column quantity
len(df.columns)

4

## how to append new row

In [27]:
# Creating the new row 
data = [                #row wise
        {'class_1': 'P','class_2': 'P','class_3': 'P','class_4': 'P','class_5':'A'}
       ]  
index=[1911025]
new_row = pd.DataFrame(data,index)
new_row

        class_1 class_2 class_3 class_4 class_5
1911025       P       P       P       P       A

In [28]:
# for appending new_row at the end of df

df = df.append(new_row, ignore_index = False) # as we have specific index, not ignoring the index

In [29]:
df

        class_1 class_2 class_3 class_4 class_5
1911022       P       P       P       P     NaN
1911023       A       P       A       P     NaN
1911024       P       P       A       P     NaN
1911025       P       P       P       P       A

## How to append new column

In [30]:
data = ['P','A','P','A']
data

['P', 'A', 'P', 'A']

In [31]:
df['class_5']=data
df

        class_1 class_2 class_3 class_4 class_5
1911022       P       P       P       P       P
1911023       A       P       A       P       A
1911024       P       P       A       P       P
1911025       P       P       P       P       A

In [32]:
# if all data keep same

data='P'
df['class_6']=data
df

        class_1 class_2 class_3 class_4 class_5 class_6
1911022       P       P       P       P       P       P
1911023       A       P       A       P       A       P
1911024       P       P       A       P       P       P
1911025       P       P       P       P       A       P

## how to see specific data

In [33]:
#accessing row by index

df.loc[1911025]

class_1    P
class_2    P
class_3    P
class_4    P
class_5    A
class_6    P
Name: 1911025, dtype: object

In [34]:
#accessing in a range of index

df.loc[1911023:1911025]

        class_1 class_2 class_3 class_4 class_5 class_6
1911023       A       P       A       P       A       P
1911024       P       P       A       P       P       P
1911025       P       P       P       P       A       P

In [35]:
# top row
df.head(2)

        class_1 class_2 class_3 class_4 class_5 class_6
1911022       P       P       P       P       P       P
1911023       A       P       A       P       A       P

In [36]:
# last row
df.tail(2)

        class_1 class_2 class_3 class_4 class_5 class_6
1911024       P       P       A       P       P       P
1911025       P       P       P       P       A       P

In [37]:
#accessing a specific column

df['class_5']

1911022    P
1911023    A
1911024    P
1911025    A
Name: class_5, dtype: object

In [38]:
#accessing a specific cell by column and index

df['class_5'][1911025]

'A'

In [39]:
# taking 2 sample row randomly
df.sample(2)

        class_1 class_2 class_3 class_4 class_5 class_6
1911023       A       P       A       P       A       P
1911022       P       P       P       P       P       P

## How to update a row

In [40]:
df.loc[1911022]

class_1    P
class_2    P
class_3    P
class_4    P
class_5    P
class_6    P
Name: 1911022, dtype: object

In [41]:
#just a value
df.at[1911022,'class_1']='A'

In [42]:
df

        class_1 class_2 class_3 class_4 class_5 class_6
1911022       A       P       P       P       P       P
1911023       A       P       A       P       A       P
1911024       P       P       A       P       P       P
1911025       P       P       P       P       A       P

In [43]:
#whole row

column=['class_1','class_2','class_3','class_4','class_5','class_6']
# or
column= list(df.columns)  # this output is same as abve

data=['A','A','A','A','A','A']

df.at[1911022,column]=data
df

        class_1 class_2 class_3 class_4 class_5 class_6
1911022       A       A       A       A       A       A
1911023       A       P       A       P       A       P
1911024       P       P       A       P       P       P
1911025       P       P       P       P       A       P

## how to update column

In [44]:
# df['column name'] = df['column name'].replace(['old value'], 'new value')

df['class_6']=df['class_6'].replace(['A'],'P')
df

        class_1 class_2 class_3 class_4 class_5 class_6
1911022       A       A       A       A       A       P
1911023       A       P       A       P       A       P
1911024       P       P       A       P       P       P
1911025       P       P       P       P       A       P

In [45]:
list(df['class_6'])

['P', 'P', 'P', 'P']

In [46]:
new_value=['A','A','A','A']
df['class_6']=df['class_6'].replace(list(df['class_6']),new_value)
df

        class_1 class_2 class_3 class_4 class_5 class_6
1911022       A       A       A       A       A       A
1911023       A       P       A       P       A       A
1911024       P       P       A       P       P       A
1911025       P       P       P       P       A       A

## Query

In [47]:
# df[ query here ]

df[ df.class_1=='P' ]

        class_1 class_2 class_3 class_4 class_5 class_6
1911024       P       P       A       P       P       A
1911025       P       P       P       P       A       A

In [48]:
df[ df.class_1=='P'] [['class_1']]

        class_1
1911024       P
1911025       P

In [49]:
df[ df.class_1=='A'] [['class_1','class_2']]

        class_1 class_2
1911022       A       A
1911023       A       P

In [50]:
df[ df.class_1=='A'].index

Int64Index([1911022, 1911023], dtype='int64')

In [51]:
list(df[ df.class_1=='A'].index)

[1911022, 1911023]

In [52]:
df[ (df.class_1=='P') &  (df.class_2=='P') ]

        class_1 class_2 class_3 class_4 class_5 class_6
1911024       P       P       A       P       P       A
1911025       P       P       P       P       A       A

In [53]:
list( df[ (df.class_1=='P') &  (df.class_2=='P') ] . index )

[1911024, 1911025]